namespace ASP_.Net_Core_Class_Home_Work.Services.Hash;

public interface IHashService
{
    String Digest(String input);
}
// Криптографічна геш-функція , або просто ге-флгоритм, який з даних довільноі довжини обчислює дайджест постійноі довжини. Ця довжина у бітах є характеристикою гешу(128-бітний , 160-, 256-)
// Використовується у задачах контролю цілісноті (правильності передач) - порівнюється хеш-дайджестів файлів до передачі та після прийому. А також для задач ціфрового підпишу - підпишується не сам документ, а його геш(дайджест - результат роботи геш-функціі) , тому до криптогешів є додаткова умава НЕПЕРЕДБАЧУВАННОСТІ (знаючи дайджест неможна відновити сам документ , або його аналог, неможна створити 2 докумнти , що мають однаковий дайджест).
// У задачах программуванях геш такох вживається для збереження паролів у БД. Даджест подається у вигляді гексадецомального рядка 
// рядок            дайджесь(MD5)
// "123456"         "E10ADC3949BA59ABBE56E057F20F883E"
// "Hello, World"   "82BB413746AEE42F89DEA2B59614F9EF"